

▶️
00:00:00 — интро
00:00:01 — задача на всплытие
00:08:08 — лексическое окружение (lexical scope)
00:17:02 — объекты в JS
00:17:08 — тип данных ключей в объекте
00:23:15 — for of по объекту
00:25:32 — this в JS
00:34:39 — Set, Map, WeakSet, WeakMap
00:36:00 — функция-конструктор
00:44:10 — промисы (promise) 
00:45:22 — event loop
00:47:35 — задача  микро/макро таски
00:49:15 — ответ на задачу
00:50:56 — задача  на промисы
00:54:00 — async await JS
00:54:44 — что такое React
00:58:44 — useState
01:01:04 — что такое virtual DOM
01:03:00 — что такое render
01:04:15 — что такое reconciliation
01:06:03 — react ключи (keys)
01:10:45 — TypeScript
01:13:30 — типизация аргументов функции
01:15:35 — any, unknown
01:16:04 — never
01:17:08 — enum
01:17:49 — | & в TS
01:19:48 — аутро


